Our merging document for the tables

In [24]:
#First we have to load all necessary libraries

import pandas as pd
import numpy as np
import psycopg2 
import requests 
from zipfile import *
from sql_functions import get_engine
import sqlalchemy

In [25]:
import sql_functions as sf
from sql_functions import get_dataframe
schema = 'roundnet'

After loading the necessary libraries we have to load the tables. As we have tables, there we want to add only one column from we want add them first before merging everything into one table. So we start with loading the surface into the tournament table

In [36]:
surface1= f'select * FROM {schema}.surface'
surface = get_dataframe(surface1)
surface.head()

   surface_id        name
0           1       Grass
1           2        Sand
2           3  Kunstrasen
3           4      Indoor
4           5        Snow

In [77]:
tournament1= f'select * FROM {schema}.tournament'
tournament_pre = get_dataframe(tournament1)
tournament_pre.head()

,event_id,event_name,date,location,surface_id,latitude,longitude,rating_tournament
0,8,Kiel Roundnet Open,2020-01-19,Kiel,4.0,54.322708,10.135555,0
1,29,Roundnet World Championships 2022,2022-09-08,Molenheide,1.0,51.082587,5.399360,0
2,102,EURA Grand Slam Freiburg,2022-07-30,Freiburg,1.0,47.990880,7.827049,0
3,2,Siegerland Open 2019,2019-11-16,Burbach,4.0,50.745600,8.080300,0
4,45,1. Roundnet Open Dresden,2020-08-30,Dresden,2.0,51.050409,13.737262,0

In [78]:
tournament=tournament_pre.merge(surface, how='left', on='surface_id')

In [79]:
tournament.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 96 entries, 0 to 95
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   event_id           96 non-null     int64
 1   event_name         96 non-null     object
 2   date               96 non-null     object
 3   location           96 non-null     object
 4   surface_id         90 non-null     float64
 5   latitude           92 non-null     float64
 6   longitude          92 non-null     float64
 7   rating_tournament  96 non-null     int64
 8   name               90 non-null     object
dtypes: float64(3), int64(2), object(4)
memory usage: 7.5+ KB

In [80]:
tournament.head()

,event_id,event_name,date,location,surface_id,latitude,longitude,rating_tournament,name
0,8,Kiel Roundnet Open,2020-01-19,Kiel,4.0,54.322708,10.135555,0,Indoor
1,29,Roundnet World Championships 2022,2022-09-08,Molenheide,1.0,51.082587,5.399360,0,Grass
2,102,EURA Grand Slam Freiburg,2022-07-30,Freiburg,1.0,47.990880,7.827049,0,Grass
3,2,Siegerland Open 2019,2019-11-16,Burbach,4.0,50.745600,8.080300,0,Indoor
4,45,1. Roundnet Open Dresden,2020-08-30,Dresden,2.0,51.050409,13.737262,0,Sand

In [81]:
tournament.rename(columns={'name': 'surface'}, inplace=True)

In [82]:
tournament.drop('surface_id', inplace=True, axis=1)

Following adding country to club

In [83]:
country1= f'select * FROM {schema}.country'
country = get_dataframe(country1)
country.head()

   country_id            name
0           1         Germany
1           2         Belgium
2           3     Netherlands
3           4  Czech Republic
4           5          Poland

In [84]:
club1= f'select * FROM {schema}.club'
club_pre = get_dataframe(club1)
club_pre.head()

,club_id,club_name,founding_date,country_id,club_insta,city,latitude,longitude,rg_member
0,1,1. Roundnetclub Opladen,2018-10-05,1,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1
1,2,1. Roundnet Club Köln,2016-09-09,1,1.roundnetclubkoeln,Köln,50.935909,6.875135,1
2,3,Roundnet Raccoons,2018-02-01,1,roundnet_raccoons,Kassel,51.315455,9.492410,0
3,4,Roundnet 069,2018-10-14,1,roundnet069,Frankfurt,50.110644,8.682092,0
4,5,Roundnet Gießen,None,1,roundnet_giessen,Gießen,50.586207,8.674231,1

In [51]:
club_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   club_id        92 non-null     int64
 1   club_name      92 non-null     object
 2   founding_date  39 non-null     object
 3   country_id     92 non-null     int64
 4   club_insta     75 non-null     object
 5   city           92 non-null     object
 6   latitude       92 non-null     float64
 7   longitude      92 non-null     float64
 8   rg_member      92 non-null     int64
dtypes: float64(2), int64(3), object(4)
memory usage: 6.6+ KB

In [52]:
club=club_pre.merge(country, how='left', on='country_id')

In [53]:
club.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 92 entries, 0 to 91
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   club_id        92 non-null     int64
 1   club_name      92 non-null     object
 2   founding_date  39 non-null     object
 3   country_id     92 non-null     int64
 4   club_insta     75 non-null     object
 5   city           92 non-null     object
 6   latitude       92 non-null     float64
 7   longitude      92 non-null     float64
 8   rg_member      92 non-null     int64
 9   name           92 non-null     object
dtypes: float64(2), int64(3), object(5)
memory usage: 7.9+ KB

In [54]:
club.rename(columns={'name': 'country'}, inplace=True)

In [55]:
club.drop('country_id', inplace=True, axis=1)

In [56]:
club.head()

,club_id,club_name,founding_date,club_insta,city,latitude,longitude,rg_member,country
0,1,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1,Germany
1,2,1. Roundnet Club Köln,2016-09-09,1.roundnetclubkoeln,Köln,50.935909,6.875135,1,Germany
2,3,Roundnet Raccoons,2018-02-01,roundnet_raccoons,Kassel,51.315455,9.492410,0,Germany
3,4,Roundnet 069,2018-10-14,roundnet069,Frankfurt,50.110644,8.682092,0,Germany
4,5,Roundnet Gießen,None,roundnet_giessen,Gießen,50.586207,8.674231,1,Germany

Now adding the country also to the player table

In [68]:
player1= f'select * FROM {schema}.player'
player_pre = get_dataframe(player1)
player_pre.head()

,player_id,first_name,last_name,player_city,player_eusra_id,club_id,country_id,gender,active_since,birth_date,player_insta,player_rg_elo,player_elo_games_total,rg_member,elo_division
0,2,Martin,Lang,Leverkusen,GERML99,1.0,1.0,m,2019.0,None,martingudelaune,1142.0,187,1,3.0
1,4,Sebastian,Köss,Köln,GERSK100,1.0,1.0,m,2019.0,1983-06-25,Herr_sybbi,1049.0,85,1,3.0
2,14,Jana,Esser,,None,1.0,1.0,f,2019.0,1991-11-29,None,951.0,10,1,2.0
3,64,Leonard,Breitzmann,,GERLB56,10.0,1.0,m,NaN,None,None,1106.0,39,1,3.0
4,65,Matias,Bermejo Pasetti,Basel,ESPMP5,10.0,24.0,m,2017.0,1994-04-27,wavingwave,1212.0,53,1,4.0

In [69]:
player_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4115 entries, 0 to 4114
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   player_id               4115 non-null   int64
 1   first_name              4115 non-null   object
 2   last_name               4111 non-null   object
 3   player_city             3179 non-null   object
 4   player_eusra_id         297 non-null    object
 5   club_id                 1941 non-null   float64
 6   country_id              4055 non-null   float64
 7   gender                  4112 non-null   object
 8   active_since            510 non-null    float64
 9   birth_date              2106 non-null   object
 10  player_insta            311 non-null    object
 11  player_rg_elo           1504 non-null   float64
 12  player_elo_games_total  4115 non-null   int64
 13  rg_member               4115 non-null   int64
 14  elo_division            1504 non-null   float64
dtypes: float64(5), int64(3), object(7)
memory usage: 482.4+ KB

In [70]:
player=player_pre.merge(country, how='left', on='country_id')

In [71]:
player.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4115 entries, 0 to 4114
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   player_id               4115 non-null   int64
 1   first_name              4115 non-null   object
 2   last_name               4111 non-null   object
 3   player_city             3179 non-null   object
 4   player_eusra_id         297 non-null    object
 5   club_id                 1941 non-null   float64
 6   country_id              4055 non-null   float64
 7   gender                  4112 non-null   object
 8   active_since            510 non-null    float64
 9   birth_date              2106 non-null   object
 10  player_insta            311 non-null    object
 11  player_rg_elo           1504 non-null   float64
 12  player_elo_games_total  4115 non-null   int64
 13  rg_member               4115 non-null   int64
 14  elo_division            1504 non-null   float64
 15  name                    4055 non-null   object
dtypes: float64(5), int64(3), object(8)
memory usage: 546.5+ KB

In [72]:
player.rename(columns={'name': 'country'}, inplace=True)

In [73]:
player.drop('country_id', inplace=True, axis=1)

In [74]:
player.head()

,player_id,first_name,last_name,player_city,player_eusra_id,club_id,gender,active_since,birth_date,player_insta,player_rg_elo,player_elo_games_total,rg_member,elo_division,country
0,2,Martin,Lang,Leverkusen,GERML99,1.0,m,2019.0,None,martingudelaune,1142.0,187,1,3.0,Germany
1,4,Sebastian,Köss,Köln,GERSK100,1.0,m,2019.0,1983-06-25,Herr_sybbi,1049.0,85,1,3.0,Germany
2,14,Jana,Esser,,None,1.0,f,2019.0,1991-11-29,None,951.0,10,1,2.0,Germany
3,64,Leonard,Breitzmann,,GERLB56,10.0,m,NaN,None,None,1106.0,39,1,3.0,Germany
4,65,Matias,Bermejo Pasetti,Basel,ESPMP5,10.0,m,2017.0,1994-04-27,wavingwave,1212.0,53,1,4.0,Spain

In [75]:
player['club_id'].convert_dtypes()

0          1
1          1
2          1
3         10
4         10
        ...
4110    <NA>
4111    <NA>
4112    <NA>
4113    <NA>
4114      14
Name: club_id, Length: 4115, dtype: Int64

The second- last small table we want to add is the division_kat to division

In [85]:
division1= f'select * FROM {schema}.division'
division_pre = get_dataframe(division1)
division_pre.head()

,tournament_id,division_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery
0,3,4,2,16,,,None,0
1,4,2,2,16,,,None,0
2,5,4,3,64,,,None,0
3,6,3,3,32,,None,None,0
4,12,4,7,24,TBA,,None,0

In [86]:
division_kat1= f'select * FROM {schema}.division_kat'
division_kat= get_dataframe(division_kat1)
division_kat.head()

   division_id           name
0            1           Open
1            2  Mixed & Women
2            3          Women
3            4            Men
4            5          Mixed

In [87]:
division_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207 entries, 0 to 206
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   tournament_id         207 non-null    int64
 1   division_id           207 non-null    int64
 2   event_id              207 non-null    int64
 3   max_teams             207 non-null    int64
 4   starting_fee          207 non-null    object
 5   starting_fee_reduced  133 non-null    object
 6   livestream            34 non-null     object
 7   use_lottery           207 non-null    int64
dtypes: int64(5), object(3)
memory usage: 13.1+ KB

In [96]:
division=division_pre.merge(division_kat, how='left', on='division_id')

In [97]:
division.head()

,tournament_id,division_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,name
0,3,4,2,16,,,None,0,Men
1,4,2,2,16,,,None,0,Mixed & Women
2,5,4,3,64,,,None,0,Men
3,6,3,3,32,,None,None,0,Women
4,12,4,7,24,TBA,,None,0,Men

In [98]:
division.rename(columns={'name': 'division'}, inplace=True)

In [99]:
division.head()

,tournament_id,division_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,division
0,3,4,2,16,,,None,0,Men
1,4,2,2,16,,,None,0,Mixed & Women
2,5,4,3,64,,,None,0,Men
3,6,3,3,32,,None,None,0,Women
4,12,4,7,24,TBA,,None,0,Men

In [100]:
division.drop('division_id', inplace=True, axis=1)

In [101]:
division.head()

,tournament_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,division
0,3,2,16,,,None,0,Men
1,4,2,16,,,None,0,Mixed & Women
2,5,3,64,,,None,0,Men
3,6,3,32,,None,None,0,Women
4,12,7,24,TBA,,None,0,Men

the last small table we wanna add is team to tteam to get in our starting table for the big one (tteam) the gender in, which information we have in team

In [102]:
tteam1= f'select * FROM {schema}.tteam'
tteam_pre = get_dataframe(tteam1)
tteam_pre.head()

,tournament_team_id,team_name,position,team_id,tournament_id,team_skill,team_rg_id,elo_diff,quali_points
0,68,Blockwurst,1.0,58,3,1,NaN,NaN,NaN
1,69,Mzungu,2.0,59,3,1,NaN,NaN,NaN
2,70,The Rangers,3.0,60,3,1,NaN,NaN,NaN
3,71,Spiking Raccoons,4.0,61,3,1,NaN,NaN,NaN
4,72,PaderSpikers,5.0,62,3,1,NaN,NaN,NaN

In [106]:
team1= f'select * FROM {schema}.team'
team = get_dataframe(team1)
team.head()

   team_id         team_name gender
0       58        Blockwurst     mm
1       59            Mzungu     mm
2       60       Big & Tasty     mm
3       61  Spiking Raccoons     mm
4       62         Paderoona     mm

In [104]:
tteam_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5515 entries, 0 to 5514
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   tournament_team_id  5515 non-null   int64
 1   team_name           5280 non-null   object
 2   position            4812 non-null   float64
 3   team_id             5515 non-null   int64
 4   tournament_id       5515 non-null   int64
 5   team_skill          5515 non-null   int64
 6   team_rg_id          3099 non-null   float64
 7   elo_diff            3099 non-null   float64
 8   quali_points        154 non-null    float64
dtypes: float64(4), int64(4), object(1)
memory usage: 387.9+ KB

In [130]:
tteam=tteam_pre.merge(team, how='left', on=['team_id','team_name'])

In [138]:
tteam.head(10)

,tournament_team_id,team_name,position,team_id,tournament_id,team_skill,team_rg_id,elo_diff,quali_points,gender
0,68,Blockwurst,1.0,58,3,1,NaN,NaN,NaN,mm
1,69,Mzungu,2.0,59,3,1,NaN,NaN,NaN,mm
2,70,The Rangers,3.0,60,3,1,NaN,NaN,NaN,NaN
3,71,Spiking Raccoons,4.0,61,3,1,NaN,NaN,NaN,mm
4,72,PaderSpikers,5.0,62,3,1,NaN,NaN,NaN,NaN
5,73,Schlammbeiser,6.0,63,3,1,NaN,NaN,NaN,mm
6,74,Bike'n'Spike,7.0,64,3,1,NaN,NaN,NaN,mm
7,75,Lang & Elend,8.0,65,3,1,NaN,NaN,NaN,mm
8,76,Team Erzquell,9.0,66,3,1,NaN,NaN,NaN,mm
9,77,Hau drauf!,10.0,67,3,1,NaN,NaN,NaN,mm